Repository: busaidi/mazoon_aluminum
Catalog: website/locale/*/LC_MESSAGES/django.po
Languages: ar

source: Name
ar: الاسم

source: Mobile Number
ar: الهاتف

source: Message
ar: اترك رسالتك

source: About
ar: من نحن

source: Our Story
ar: قصتنا

source: Mazoon Aluminum is a leading and unique Omani brand in the field of developing and manufacturing windows and doors systems made of both aluminum and aluminium thermal break. Our systems are characterized by high quality, thanks to the experience we have gained from working in this field over the stages we have gone through. Starting from the establishment phase in 2016 until the systems are independently developed starting in 2021.
ar: مزون المنيوم هي علامة تجارية عمانية رائدة ومتفردة في مجال تطوير وتصنيع أنظمة النوافذ والأبواب المصنعة من كل من الألمنيوم والألمنيوم العازل للحرارة، حيث تمتاز أنظمتنا بالجودة العالية، ويرجع الفضل في ذلك إلي الخبرة الي إكتسبناها من واقع العمل في هذا المجال على مدى المراحل التي مررنا بها بدءً من مرحلة التأسيس في عام 2016 وصولاً إلى مرحلة تطوير الأنظمة بشكل مستقل بدءً من عام 2021.

source: About Mazoon Aluminum
ar: حول مزون المنيوم

source: Leading the way in innovation and quality since 2016.
ar: رائدة الطريق في الابتكار والجودة منذ عام 2016.

source: Our Journey in Brief
ar: المراحل بشكل موجز:

source: Investment Corporation was established to be the leading organization that provides you with high-quality uPVC windows and doors under the trade name Apex Windows.
ar: تأسست مؤسسة استثمار لتكون المؤسسة الرائدة التي توفر لك نوافذ وأبواب الـuPVC عالية الجودة تحت الاسم التجاري Apex Windows.

source: Thanks to our pursuit of high quality products to achieve our goal; We added thermally insulated aluminum window, door and curtain systems.
ar: بفضل سعينا للحصول على منتجات عالية الجودة لتحقيق هدفنا؛ أضفنا أنظمة النوافذ والأبواب والستائر الجدارية المصنعة من الألمنيوم والألمنيوم العازل للحرارة.

source: We launched the first aluminum system for windows and doors of our own design, as we employed our previous experiences to obtain the Mazoon 45 system. Simultaneously, we launched the Mazoon Aluminum brand.
ar: قمنا بتدشين أول نظام المنيوم للنوافذ والأبواب من تصميمنا الخاص، حيث وظفنا خبراتنا السابقة للحصول على نظام مزون45. تزامنًا قمنا بتدشين العلامة التجارية مزون المنيوم.

source: With continued success with the Mazoon 45 system, we launched the Mazoon 60 thermal break system. In addition to developing a curtain wall system.
ar: مع توالي النجاح مع نظام مزون٤٥، قمنا بتدشين نظام مزون60 العازل للحرارة. بالإضافة تطوير نظام الستائر الجدارية.

source: Mazoon Aluminum: A Benchmark of Quality
ar: مزون المنيوم: معيار للجودة

source: Our distinctive feature is the combination of innovative design and high-quality materials that are used in common with all of our current systems, namely Mozoon 45, Mozoon 60, and Mozoon curtain walls, which leads to the integration of our systems with each other, and meets the unique requirements of our customers, with our unwavering commitment to excellence and customer satisfaction. Throughout our development, we have been driven by constant innovation, adaptability and a passion for serving our customers. Our goal? Not just leading the aluminum industry, but shaping its future, setting new standards.
ar: السمة المميزة لدينا هي مزيج من التصميم المبتكر والمواد عالية الجودة التي تستخدم مشتركة لكل انظمتنا الحالية وهي مزون٤٥ ،ومزون٦٠ ، ومزون الستائر الجدارية مما يؤدي إلى تكامل انظمتنا مع بعضها البعض، ويلبي المتطلبات الفريدة لعملائنا، مع التزامنا الثابت بالتميز ورضا العملاء. طوال تطورنا، كنا مدفوعين بالابتكار المستمر والقدرة على التكيف والشغف لخدمة عملائنا. هدفنا؟ ليس فقط قيادة صناعة الألمنيوم، بل تشكيل مستقبلها، ووضع معايير جديدة.

source: Contact Us
ar: الاتصال بنا

source: Submit
ar: ارسل

source: Our Location
ar: مواقعنا

source: Office
ar: المكتب

source: Abraj Al Muhlab, Al Ansab, Muscat, Sultanate Of Oman
ar: ابراج المهلب، الانصب، مسقط، سلطنة عمان

source: Fabrication
ar: الورشة

source: Industrial Area, Al Suwaiq, Sultanate Of Oman
ar: المنطقة الصناعية، السويق، سلطنة عمان

source: Email
ar: البريد الالكتروني

source: Phone Numbers
ar: الهاتف

source: Administrator
ar: الإدارة

source: Sales
ar: المبيعات

source: Home Page
ar: الرئيسية

source: Welcome To Mazoon Aluminum!
ar: مزون المنيوم ترحب بك!

source: The first private company in Oman to make and develop aluminum and window systems.
ar: مزون المنيوم أول شركة عمانية خاصة تعنى بتطوير أنظمة الألمنيوم للنوافذ والأبواب.

source: Learn More About Us!
ar: تعرف علينا اكثر!

source: Our Commitment to Quality
ar: التزامنا بالجودة

source: At Mazoon Aluminum, we extrude our aluminum profiles from Napco Oman, certified with ISO standards. Our products are built to last and designed to impress.
ar: في شركة مزون للألمنيوم، نقوم بسحب مقاطع الألمنيوم من شركة نابكو عمان، المعتمدة بمعايير ISO. منتجاتنا مصممة لتدوم طويلاً ومصممة لإثارة إعجابك.

source: Learn more about Napco Oman
ar: إقرأ عن نابكو أكثر!

source: Aluminum Windows And Doors Systems Feature
ar: ما تتميز به انظمتنا الخاصة للنوافذ والأبواب

source: Products
ar: المنتجات

source: Product Image
ar: صورة المنتج

source: Mazoon 45 Casement System
ar: مزون٤٥ نظام مفصلي

source: Where Design Meets Durability.
ar: حيث يلتقي التصميم بالمتانة.

source: The Mazoon 45 window and door system embodies a harmonious combination of ease of manufacture and quality produced. As a hinged system, it is beautifully designed and luxurious to deliver contemporary aesthetics combined with powerful performance. Every detail is designed with the latest, highest quality technology, making the windows and doors enjoy unparalleled durability, easy maintenance, and a distinctive elegant appearance.
ar: يجسد نظام النوافذ والأبواب مزون٤٥ مزيجًا متناغمًا من سهولة التصنيع وجودة الإنتاج. كنظام مفصلي، فهو مصمم بشكل جميل وفاخر لتقديم جماليات معاصرة مدمجة مع أداء قوي. كل تفصيل مصمم بأحدث وأعلى جودة تكنولوجية، مما يجعل النوافذ والأبواب تتمتع بمتانة لا مثيل لها وسهولة صيانة ومظهر أنيق مميز.

source: Learn more
ar: إقرأ المزيد!

source: Mazoon Lab
ar: مختبر مزون

source: Mazoon 45
ar: مزون٤٥

source: The Mazoon 45 window and door system embodies a harmonious combination of ease of manufacture and quality production. As a hinged system, it is beautifully designed and luxurious to deliver contemporary aesthetics combined with powerful performance. Every detail is designed with the latest, highest quality technology, making the windows and doors enjoy unparalleled durability, easy maintenance, and a distinctive elegant appearance.
ar: يجسد نظام النوافذ والأبواب مزون٤٥ مزيجًا متناغمًا من سهولة التصنيع وجودة الإنتاج. كنظام مفصلي، فهو مصمم بشكل جميل وفاخر لتقديم جماليات معاصرة مدمجة مع أداء قوي. كل تفصيل مصمم بأحدث وأعلى جودة تكنولوجية، مما يجعل النوافذ والأبواب تتمتع بمتانة لا مثيل لها وسهولة صيانة ومظهر أنيق مميز.

source: Mazoon45 Systems Features
ar: خصائص نظام مزون٤٥

source: Triple Sealing EPDM
ar: عزل ثلاثي من نوع EPDM

source: Equipped with three EPDM insulators, the Mozoon 45 system provides strong insulation. This ensures protection against dust and rain seepage, and provides superior sound insulation, making it a beacon of calm in a noisy urban landscape.
ar: مجهز بثلاثة عوازل EPDM، يوفر نظام مزون٤٥ عزلًا قويًا. يضمن ذلك الحماية من الغبار وتسرب المياه، ويوفر عزلًا صوتيًا فائقًا، مما يجعله منارة للهدوء في بيئة حضرية صاخبة.

source: Your browser does not support the video tag.
ar: متصفحك لا يدعم وسم الفيديو.

source: Corner Joint
ar: تجميع الزوايا

source: Precision is the key to excellent manufacturing. We use crimped corner joints for added strength, and each corner is fortified with aligned corner joints, ensuring perfect alignment and enhanced stability in every detail of your window or door.
ar: الدقة هي المفتاح للحصول على تصنيع ممتاز. نحن نستخدم مفاصل زاوية مجعدة لمزيد من القوة، ويتم تحصين كل زاوية بمفاصل زاوية محاذاة، مما يضمن محاذاة مثالية وثبات معزز في كل تفاصيل نافذتك أو بابك.

source: Mullion Connector
ar: تجميع القواطع

source: Our approach to strength and durability in manufacturing ensures that every detail, even if it is small, is assembled using two hidden screws. This not only enhances the structure but also maintains the elegant appearance of the system.
ar: يضمن نهجنا في الحصول على قوة ومتانة في التصنيع جميع التفاصيل حتى لو كانت صغيرة، فكل موليون(T) يتم تجميعه باستخدام اثنين من البراغي المخفية. وهذا لا يعزز الهيكل فحسب، بل يحافظ أيضًا على المظهر الأنيق للنظام.

source: Adaptable Profiles
ar: مرونة التخصيص

source: The Mazoon 45 system is versatile and meets a variety of architectural needs such as circular windows and more. Whether you are aiming for a wide panoramic view or a segmented window design, our system adapts easily.
ar: يتميز نظام مزون ٤٥ بأنه متعددة الاستخدامات ويلبي مجموعة متنوعة من الاحتياجات المعمارية مثل النوافذ الدائرية وغيرها، سواء كنت تهدف إلى رؤية بانورامية واسعة أو تصميم نافذة مجزأ، فإن نظامنا يتكيف بسهولة.

source: Thermal Efficiency
ar: العزل الحراري

source: Our windows and doors help insulate outside heat from your home. Your home stays warm in cold times and cool in hot times. This means less use of heaters or air conditioners, saving you money.
ar: تساعد النوافذ والأبواب لدينا في عزل الحرارة الخارجية عن منزلك. يبقى منزلك دافئًا في الأوقات الباردة وباردًا في الأوقات الحارة. وهذا يعني استخدام أقل للسخانات أو مكيفات الهواء، مما يوفر لك المال.

source: Sound Barrier
ar: العزل الصوتي

source: Tired of street noise and outside sounds in general? Our products isolate most unwanted sounds. Enjoy the peace inside, even if there is noise outside.
ar: تعبت من ضجيج الشوارع والأصوات الخارجية بشكل عام؟ تعزل منتجاتنا معظم الأصوات غير المرغوب فيها. استمتع بالهدوء في الداخل، حتى لو كان هناك ضجيج في الخارج.

source: Rain Guard
ar: حماية من الأمطار

source: Don't worry about rainwater getting inside. Our windows and doors have special seals to keep the rain outside.
ar: لا تقلق بشأن دخول مياه الأمطار إلى الداخل. تحتوي نوافذنا وأبوابنا على موانع تسرب خاصة لمنع المطر في الخارج.

source: Low Maintenance
ar: قليل الصيانة

source: Cleaning is easy. A little wipe-down is all you need to make them look new again.
ar: التنظيف سهل. كل ما تحتاجه هو مسح بسيط لتجعلها تبدو جديدة مرة أخرى.

source: Eco Choice
ar: صديق للبيئة

source: Aluminum is special because it can be recycled many times, saving lots of energy. When we recycle it, we create less waste, and the recycled aluminum is just as good as new.
ar: الألومنيوم مميز لأنه يمكن إعادة تدويره عدة مرات، مما يوفر الكثير من الطاقة. عندما نقوم بإعادة تدويره، فإننا ننتج نفايات أقل، ويصبح الألومنيوم المعاد تدويره بنفس جودة الجديد.

source: Built Strong
ar: قوي البنية

source: Aluminum is easy to form and strong, so it can withstand sun, wind and rain for many years.
ar: يمتاز الألمنيوم بسهولة التشكيل والصلابة لذلك يمكنه تحمل الشمس والرياح والمطر لسنوات عديدة.

source: Design Flexibility
ar: مرونة التصميم

source: Want different designs? We have many designs to suit the look of your home.
ar: تريد تصاميم مختلفة؟ لدينا العديد من التصاميم لتناسب مظهر منزلك.

source: Easy Install
ar: سهولة التركيب

source: Light yet strong, our windows and doors are easy to manufacture, install and are long-lasting.
ar: خفيفة ولكن قوية، نوافذنا وأبوابنا سهلة التصنيع والتركيب وطويلة الأمد.

source: Your message has been sent successfully!
ar: تم إرسال رسالتك بنجاح.

source: There was an error with your submission.
ar: هناك خطأ في تسليم الرسالة
